app/Http/Controllers/Auth/LoginController.php

select * from `users` where `github_id` = '20116830' limit 1
---
    private function findOrCreateUser($githubUser)
    {
        if ($authUser = User::where('github_id', $githubUser->id)->first()) {