app/Http/Controllers/PostsController.php

    public function update($id, UpdatePostRequest $request)
    {

        try {
            $post = Post::findOrFail($id);
        } catch (ModelNotFoundException $e) {
            return Response::view('errors.404');
        }
        $post->update($request->all());
---
update `posts` set `title` = '88888888888888888888888888', `updated_at` = '2018-04-18 20:57:17', `description` = '88888888888888888888888888888888888888', `user_id` = '8' where `id` = '36'

    public function destroy($id)
    {
        Post::destroy($id);
---
delete from `posts` where `id` = '40'