app/Http/Controllers/PostsController.php

select * from `posts`
select * from `users` where `users`.`id` in ('1', '2', '3')
---
    public function index()
    {
        // dd("hello from posts");
        // return Post::all();
        //$posts = Post::all();
        //Eager Loading
        $posts=Post::with("user")->get();

select * from `users`
---
    public function create()
    {
        $users = User::all();

select * from `posts` where `posts`.`id` = '36' limit 1
---
    public function show($id)
    {
        // $post = DB::table(‘posts’)->find($id);
        $post = Post::findOrFail($id);

select * from `users`
select * from `posts` where `posts`.`id` = '28' limit 1
---
    public function edit($id)
    {
        $users = User::all();
        $post = Post::findOrFail($id);

select * from `posts` where `id` in ('32')
---
    public function update($id, UpdatePostRequest $request)
    {
        // try{

        // }catch (ModelNotFoundException $e ) {

        // }

        $post = Post::findOrFail($id);

delete from `posts` where `id` = '32'
---
    public function destroy($id, Request $request)
    {
        Post::destroy($id);